; domain
(define (domain pacman-63)
   (:requirements :strips :typing)
   (:types node)
   
   (:predicates
      (has_food ?location - node)
      (no_food ?location - node)
      (is_safe ?location - node)               ; complement of is_opponent_ghost
      (is_visited ?location)
      (at ?location - node)
      (not_at ?location - node)
      (connected ?n1 ?n2 - node)
   )

   (:action move_pacman
      :parameters (?start ?end - node)
      :precondition (and
         (at ?start)
         (not_at ?end)
         (no_food ?end)
         (connected ?start ?end)
         (is_safe ?end)
      )
      :effect (and
         (at ?end)
         (not_at ?start)
         (is_visited ?end)
      )
   )

   (:action eat_food
      :parameters (?start ?end - node)
      :precondition (and
         (at ?start)
         (has_food ?end)
         (connected ?start ?end)
         (is_safe ?end)
      )
      :effect (and
         (at ?end)
         (not_at ?start)
         (no_food ?end)
         (is_visited ?end)
      )
   )
)

; problem
(define (problem pacman-63)
    (:domain pacman-63)
    (:objects
        n0_0 n0_1 n0_2 n0_3 n0_4 n0_5 n0_6 n0_7 n1_0 n1_1 n1_2 n1_3 n1_4 n1_5 n1_6 n1_7 n2_0 n2_1 n2_2 n2_3 n2_4 n2_5 n2_6 n2_7 n3_0 n3_1 n3_2 n3_3 n3_4 n3_5 n3_6 n3_7 n4_0 n4_1 n4_2 n4_3 n4_4 n4_5 n4_6 n4_7 n5_0 n5_1 n5_2 n5_3 n5_4 n5_5 n5_6 n5_7 n6_0 n6_1 n6_2 n6_3 n6_4 n6_5 n6_6 n6_7 n7_0 n7_1 n7_2 n7_3 n7_4 n7_5 n7_6 n7_7 - node
    )

    (:init
        (not_at n0_0)
        (not_at n0_1)
        (not_at n0_2)
        (not_at n0_3)
        (not_at n0_4)
        (not_at n0_5)
        (not_at n0_6)
        (not_at n0_7)
        (not_at n1_0)
        (not_at n1_1)
        (not_at n1_2)
        (not_at n1_3)
        (not_at n1_4)
        (not_at n1_5)
        (not_at n1_6)
        (not_at n1_7)
        (not_at n2_0)
        (not_at n2_1)
        (at n2_2)
        (not_at n2_3)
        (not_at n2_4)
        (not_at n2_5)
        (not_at n2_6)
        (not_at n2_7)
        (not_at n3_0)
        (not_at n3_1)
        (not_at n3_2)
        (not_at n3_3)
        (not_at n3_4)
        (not_at n3_5)
        (not_at n3_6)
        (not_at n3_7)
        (not_at n4_0)
        (not_at n4_1)
        (not_at n4_2)
        (not_at n4_3)
        (not_at n4_4)
        (not_at n4_5)
        (not_at n4_6)
        (not_at n4_7)
        (not_at n5_0)
        (not_at n5_1)
        (not_at n5_2)
        (not_at n5_3)
        (not_at n5_4)
        (not_at n5_5)
        (not_at n5_6)
        (not_at n5_7)
        (not_at n6_0)
        (not_at n6_1)
        (not_at n6_2)
        (not_at n6_3)
        (not_at n6_4)
        (not_at n6_5)
        (not_at n6_6)
        (not_at n6_7)
        (not_at n7_0)
        (not_at n7_1)
        (not_at n7_2)
        (not_at n7_3)
        (not_at n7_4)
        (not_at n7_5)
        (not_at n7_6)
        (not_at n7_7)
        (no_food n0_0)
        (no_food n0_1)
        (no_food n0_2)
        (no_food n0_3)
        (no_food n0_4)
        (no_food n0_5)
        (no_food n0_6)
        (has_food n0_7)
        (no_food n1_0)
        (no_food n1_1)
        (no_food n1_2)
        (no_food n1_3)
        (no_food n1_4)
        (no_food n1_5)
        (no_food n1_6)
        (no_food n1_7)
        (no_food n2_0)
        (no_food n2_1)
        (no_food n2_2)
        (no_food n2_3)
        (no_food n2_4)
        (no_food n2_5)
        (no_food n2_6)
        (no_food n2_7)
        (no_food n3_0)
        (no_food n3_1)
        (no_food n3_2)
        (has_food n3_3)
        (no_food n3_4)
        (no_food n3_5)
        (no_food n3_6)
        (no_food n3_7)
        (no_food n4_0)
        (no_food n4_1)
        (has_food n4_2)
        (no_food n4_3)
        (no_food n4_4)
        (no_food n4_5)
        (no_food n4_6)
        (no_food n4_7)
        (has_food n5_0)
        (no_food n5_1)
        (no_food n5_2)
        (no_food n5_3)
        (no_food n5_4)
        (no_food n5_5)
        (no_food n5_6)
        (no_food n5_7)
        (no_food n6_0)
        (no_food n6_1)
        (no_food n6_2)
        (no_food n6_3)
        (no_food n6_4)
        (no_food n6_5)
        (no_food n6_6)
        (no_food n6_7)
        (has_food n7_0)
        (no_food n7_1)
        (no_food n7_2)
        (no_food n7_3)
        (has_food n7_4)
        (no_food n7_5)
        (no_food n7_6)
        (no_food n7_7)
        (is_safe n0_2)
        (is_safe n0_3)
        (is_safe n0_4)
        (is_safe n0_6)
        (is_safe n0_7)
        (is_safe n1_1)
        (is_safe n1_2)
        (is_safe n1_3)
        (is_safe n1_4)
        (is_safe n1_5)
        (is_safe n1_6)
        (is_safe n1_7)
        (is_safe n2_0)
        (is_safe n2_1)
        (is_safe n2_2)
        (is_safe n2_3)
        (is_safe n2_4)
        (is_safe n2_5)
        (is_safe n2_6)
        (is_safe n2_7)
        (is_safe n3_0)
        (is_safe n3_1)
        (is_safe n3_2)
        (is_safe n3_3)
        (is_safe n3_4)
        (is_safe n3_6)
        (is_safe n3_7)
        (is_safe n4_0)
        (is_safe n4_1)
        (is_safe n4_2)
        (is_safe n4_3)
        (is_safe n4_4)
        (is_safe n4_5)
        (is_safe n4_6)
        (is_safe n4_7)
        (is_safe n5_0)
        (is_safe n5_1)
        (is_safe n5_2)
        (is_safe n5_3)
        (is_safe n5_4)
        (is_safe n5_5)
        (is_safe n5_6)
        (is_safe n5_7)
        (is_safe n6_0)
        (is_safe n6_2)
        (is_safe n6_3)
        (is_safe n6_4)
        (is_safe n6_5)
        (is_safe n6_6)
        (is_safe n6_7)
        (is_safe n7_0)
        (is_safe n7_1)
        (is_safe n7_2)
        (is_safe n7_4)
        (is_safe n7_5)
        (is_safe n7_6)
        (is_safe n7_7)
        (connected n0_0 n1_0)
        (connected n1_0 n0_0)
        (connected n0_0 n0_1)
        (connected n0_1 n0_0)
        (connected n0_1 n1_1)
        (connected n1_1 n0_1)
        (connected n0_1 n0_2)
        (connected n0_2 n0_1)
        (connected n0_2 n1_2)
        (connected n1_2 n0_2)
        (connected n0_2 n0_3)
        (connected n0_3 n0_2)
        (connected n0_3 n1_3)
        (connected n1_3 n0_3)
        (connected n0_3 n0_4)
        (connected n0_4 n0_3)
        (connected n0_4 n1_4)
        (connected n1_4 n0_4)
        (connected n0_4 n0_5)
        (connected n0_5 n0_4)
        (connected n0_5 n1_5)
        (connected n1_5 n0_5)
        (connected n0_5 n0_6)
        (connected n0_6 n0_5)
        (connected n0_6 n1_6)
        (connected n1_6 n0_6)
        (connected n0_6 n0_7)
        (connected n0_7 n0_6)
        (connected n0_7 n1_7)
        (connected n1_7 n0_7)
        (connected n1_0 n2_0)
        (connected n2_0 n1_0)
        (connected n1_0 n1_1)
        (connected n1_1 n1_0)
        (connected n1_1 n2_1)
        (connected n2_1 n1_1)
        (connected n1_1 n1_2)
        (connected n1_2 n1_1)
        (connected n1_2 n2_2)
        (connected n2_2 n1_2)
        (connected n1_2 n1_3)
        (connected n1_3 n1_2)
        (connected n1_3 n2_3)
        (connected n2_3 n1_3)
        (connected n1_3 n1_4)
        (connected n1_4 n1_3)
        (connected n1_4 n2_4)
        (connected n2_4 n1_4)
        (connected n1_4 n1_5)
        (connected n1_5 n1_4)
        (connected n1_5 n2_5)
        (connected n2_5 n1_5)
        (connected n1_5 n1_6)
        (connected n1_6 n1_5)
        (connected n1_6 n2_6)
        (connected n2_6 n1_6)
        (connected n1_6 n1_7)
        (connected n1_7 n1_6)
        (connected n1_7 n2_7)
        (connected n2_7 n1_7)
        (connected n2_0 n3_0)
        (connected n3_0 n2_0)
        (connected n2_0 n2_1)
        (connected n2_1 n2_0)
        (connected n2_1 n3_1)
        (connected n3_1 n2_1)
        (connected n2_1 n2_2)
        (connected n2_2 n2_1)
        (connected n2_2 n3_2)
        (connected n3_2 n2_2)
        (connected n2_2 n2_3)
        (connected n2_3 n2_2)
        (connected n2_3 n3_3)
        (connected n3_3 n2_3)
        (connected n2_3 n2_4)
        (connected n2_4 n2_3)
        (connected n2_4 n3_4)
        (connected n3_4 n2_4)
        (connected n2_4 n2_5)
        (connected n2_5 n2_4)
        (connected n2_5 n3_5)
        (connected n3_5 n2_5)
        (connected n2_5 n2_6)
        (connected n2_6 n2_5)
        (connected n2_6 n3_6)
        (connected n3_6 n2_6)
        (connected n2_6 n2_7)
        (connected n2_7 n2_6)
        (connected n2_7 n3_7)
        (connected n3_7 n2_7)
        (connected n3_0 n4_0)
        (connected n4_0 n3_0)
        (connected n3_0 n3_1)
        (connected n3_1 n3_0)
        (connected n3_1 n4_1)
        (connected n4_1 n3_1)
        (connected n3_1 n3_2)
        (connected n3_2 n3_1)
        (connected n3_2 n4_2)
        (connected n4_2 n3_2)
        (connected n3_2 n3_3)
        (connected n3_3 n3_2)
        (connected n3_3 n4_3)
        (connected n4_3 n3_3)
        (connected n3_3 n3_4)
        (connected n3_4 n3_3)
        (connected n3_4 n4_4)
        (connected n4_4 n3_4)
        (connected n3_4 n3_5)
        (connected n3_5 n3_4)
        (connected n3_5 n4_5)
        (connected n4_5 n3_5)
        (connected n3_5 n3_6)
        (connected n3_6 n3_5)
        (connected n3_6 n4_6)
        (connected n4_6 n3_6)
        (connected n3_6 n3_7)
        (connected n3_7 n3_6)
        (connected n3_7 n4_7)
        (connected n4_7 n3_7)
        (connected n4_0 n5_0)
        (connected n5_0 n4_0)
        (connected n4_0 n4_1)
        (connected n4_1 n4_0)
        (connected n4_1 n5_1)
        (connected n5_1 n4_1)
        (connected n4_1 n4_2)
        (connected n4_2 n4_1)
        (connected n4_2 n5_2)
        (connected n5_2 n4_2)
        (connected n4_2 n4_3)
        (connected n4_3 n4_2)
        (connected n4_3 n5_3)
        (connected n5_3 n4_3)
        (connected n4_3 n4_4)
        (connected n4_4 n4_3)
        (connected n4_4 n5_4)
        (connected n5_4 n4_4)
        (connected n4_4 n4_5)
        (connected n4_5 n4_4)
        (connected n4_5 n5_5)
        (connected n5_5 n4_5)
        (connected n4_5 n4_6)
        (connected n4_6 n4_5)
        (connected n4_6 n5_6)
        (connected n5_6 n4_6)
        (connected n4_6 n4_7)
        (connected n4_7 n4_6)
        (connected n4_7 n5_7)
        (connected n5_7 n4_7)
        (connected n5_0 n6_0)
        (connected n6_0 n5_0)
        (connected n5_0 n5_1)
        (connected n5_1 n5_0)
        (connected n5_1 n6_1)
        (connected n6_1 n5_1)
        (connected n5_1 n5_2)
        (connected n5_2 n5_1)
        (connected n5_2 n6_2)
        (connected n6_2 n5_2)
        (connected n5_2 n5_3)
        (connected n5_3 n5_2)
        (connected n5_3 n6_3)
        (connected n6_3 n5_3)
        (connected n5_3 n5_4)
        (connected n5_4 n5_3)
        (connected n5_4 n6_4)
        (connected n6_4 n5_4)
        (connected n5_4 n5_5)
        (connected n5_5 n5_4)
        (connected n5_5 n6_5)
        (connected n6_5 n5_5)
        (connected n5_5 n5_6)
        (connected n5_6 n5_5)
        (connected n5_6 n6_6)
        (connected n6_6 n5_6)
        (connected n5_6 n5_7)
        (connected n5_7 n5_6)
        (connected n5_7 n6_7)
        (connected n6_7 n5_7)
        (connected n6_0 n7_0)
        (connected n7_0 n6_0)
        (connected n6_0 n6_1)
        (connected n6_1 n6_0)
        (connected n6_1 n7_1)
        (connected n7_1 n6_1)
        (connected n6_1 n6_2)
        (connected n6_2 n6_1)
        (connected n6_2 n7_2)
        (connected n7_2 n6_2)
        (connected n6_2 n6_3)
        (connected n6_3 n6_2)
        (connected n6_3 n7_3)
        (connected n7_3 n6_3)
        (connected n6_3 n6_4)
        (connected n6_4 n6_3)
        (connected n6_4 n7_4)
        (connected n7_4 n6_4)
        (connected n6_4 n6_5)
        (connected n6_5 n6_4)
        (connected n6_5 n7_5)
        (connected n7_5 n6_5)
        (connected n6_5 n6_6)
        (connected n6_6 n6_5)
        (connected n6_6 n7_6)
        (connected n7_6 n6_6)
        (connected n6_6 n6_7)
        (connected n6_7 n6_6)
        (connected n6_7 n7_7)
        (connected n7_7 n6_7)
        (connected n7_0 n7_1)
        (connected n7_1 n7_0)
        (connected n7_1 n7_2)
        (connected n7_2 n7_1)
        (connected n7_2 n7_3)
        (connected n7_3 n7_2)
        (connected n7_3 n7_4)
        (connected n7_4 n7_3)
        (connected n7_4 n7_5)
        (connected n7_5 n7_4)
        (connected n7_5 n7_6)
        (connected n7_6 n7_5)
        (connected n7_6 n7_7)
        (connected n7_7 n7_6)
    )

    (:goal (and
        (no_food n5_0)
        (no_food n4_2)
        (no_food n3_3)
        (no_food n0_7)
        (no_food n7_0)
        (no_food n7_4)
    ))
)

; plan
1. (move_pacman n2_2 n2_3)
   added: (at n2_3) (not_at n2_2) (is_visited n2_3)
   goals met: 0 of 6
2. (move_pacman n2_3 n2_4)
   added: (at n2_4) (is_visited n2_4)
   goals met: 0 of 6
3. (move_pacman n2_4 n2_5)
   added: (at n2_5) (is_visited n2_5)
   goals met: 0 of 6
4. (move_pacman n2_5 n2_6)
   added: (at n2_6) (is_visited n2_6)
   goals met: 0 of 6
5. (move_pacman n2_6 n1_6)
   added: (at n1_6) (is_visited n1_6)
   goals met: 0 of 6
6. (move_pacman n1_6 n0_6)
   added: (at n0_6) (is_visited n0_6)
   goals met: 0 of 6
7. (eat_food n0_6 n0_7)
   added: (at n0_7) (no_food n0_7) (is_visited n0_7)
   goals met: 1 of 6
8. (eat_food n2_3 n3_3)
   added: (at n3_3) (no_food n3_3) (is_visited n3_3)
   goals met: 2 of 6
9. (move_pacman n3_3 n4_3)
   added: (at n4_3) (is_visited n4_3)
   goals met: 2 of 6
10. (eat_food n4_3 n4_2)
   added: (at n4_2) (no_food n4_2) (is_visited n4_2)
   goals met: 3 of 6
11. (move_pacman n4_3 n5_3)
   added: (at n5_3) (is_visited n5_3)
   goals met: 3 of 6
12. (move_pacman n5_3 n5_2)
   added: (at n5_2) (is_visited n5_2)
   goals met: 3 of 6
13. (move_pacman n5_3 n5_4)
   added: (at n5_4) (is_visited n5_4)
   goals met: 3 of 6
14. (move_pacman n5_4 n6_4)
   added: (at n6_4) (is_visited n6_4)
   goals met: 3 of 6
15. (move_pacman n5_2 n5_1)
   added: (at n5_1) (is_visited n5_1)
   goals met: 3 of 6
16. (eat_food n6_4 n7_4)
   added: (at n7_4) (no_food n7_4) (is_visited n7_4)
   goals met: 4 of 6
17. (eat_food n5_1 n5_0)
   added: (at n5_0) (no_food n5_0) (is_visited n5_0)
   goals met: 5 of 6
18. (move_pacman n5_0 n6_0)
   added: (at n6_0) (is_visited n6_0)
   goals met: 5 of 6
19. (eat_food n6_0 n7_0)
   added: (at n7_0) (no_food n7_0) (is_visited n7_0)
   goals met: 6 of 6
